convergenceStudy/5/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            (atmosphericModels);

application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;
//stopAt          writeNow;

endTime         2000;

deltaT          1;

writeControl    adjustable;

writeInterval   100;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           25;

maxAlphaCo      15;

maxDeltaT       0.05;


functions
{
    forces
    {
        type            forces;
        libs            (forces);
        patches         (hull);
        rhoInf          998.8;
        log             on;
        writeControl    timeStep;
        writeInterval   1;
        CofR            (2.929541 0 0.2);
    }

residuals
   {
	type            solverInfo;
	libs            (utilityFunctionObjects);
	writeControl    timeStep;
	writeInterval   1;
	fields (alpha.water p_rgh);
   }

}


// ************************************************************************* //
